# = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = =


# МОЖНО ИЗМЕНЯТЬ

# "Название кнопки": "Callback.data"


QUEUES_LIST = ["Авто", "Мото", "Вело"]
DISTRICS_LIST   =  ['Адыгея', 'Центр верх', 'Зап.Обход', 'Дзержинска', 'Восточка табачка', 'Петра Метальнико...', '4ч.север', '4ч.запад', '4ч.восток', 'Плодородная 1/2', 'Фест 45 м.', 'Фест', 'Куб наб.', 'Юбик', 'Немецкая', 'Верх зап.обход', 'Центр сад. пром.', 'Восточка верх', 'Аэро', 'Крас.партизан', 'Железнодор.', 'Гидрострой', 'Восточка панорама', 'Удобная', 'Центр низ', 'Губернское', 'Зиповская']
MAX_QUEUE_TIME: int = 70 * 60 # В секундах
ADMIN_LIST = [5949089515]














# = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = =

# Не изменять
if input("Это тест?(y/n): ") == "y":
    TEST = True
else:
    TEST = False


TEST_BOT_TOKEN  = "6379536272:AAGdsFPNfQBYwhvH4k69u_MjQuSi8-ruFbk"
TEST_CHAT_ID    = "-1001835250790"
TEST_THREAD_ID  = None


BOT_TOKEN   = ""
CHAT_ID     = ""
THREAD_ID   = ""


if TEST:
    BOT_TOKEN   = TEST_BOT_TOKEN
    CHAT_ID     = TEST_CHAT_ID
    THREAD_ID   = None
else:
    BOT_TOKEN   = input("Введите BOT_TOKEN: ")
    CHAT_ID     = input("Введите CHAT_ID: ")
    THREAD_ID   = input("Введите THREAD_ID (если это не форум нажмите enter): ")